-- Пользователи 
INSERT INTO Users (reg_date, city) VALUES
	('2026-01-15', 'Москва'),
	('2026-01-20', 'Санкт-Петербург'),
	('2026-01-25', 'Самара'),
	('2026-02-01', 'Ростов-на-Дону'),
	('2026-02-08', 'Иваново'),
	('2026-02-10', 'Ульяновск'),
	('2026-02-15', 'Екатеринбург'),
	('2026-02-25', 'Санкт-Петербург');

-- Товары
INSERT INTO Products (category, price) VALUES
	('Бытовая техника', 15999.99),
	('Электроника', 28999.99),
	('Бытовая техника', 19999.99),
	('Одежда', 6999.99),
	('Товары для дома', 5999.99),
	('Бытовая техника', 29999.99),
	('Товары для дома', 7999.99),
	('Одежда', 3799.99),
	('Электроника', 14999.99),
	('Бытовая техника', 15999.99),
	('Одежда', 1499.99);

-- Заказы (с покупками и отменами)
INSERT INTO Orders (user_id, product_id, order_date, quantity, status) VALUES
	(1, 2, '2026-01-20', 1, 'Completed'),
	(1, 5, '2026-02-15', 2, 'Completed'),
	(3, 1, '2026-01-25', 1, 'Cancelled'),
	(3, 1, '2026-01-30', 1, 'Completed'),
	(2, 3, '2026-01-25', 2, 'Completed'),
	(2, 4, '2026-01-30', 3, 'Completed'),
	(2, 5, '2026-02-04', 1, 'Completed'),
	(3, 6, '2026-02-15', 1, 'Completed'),
	(4, 7, '2026-02-05', 2, 'Completed'),
	(4, 6, '2026-02-15', 1, 'Completed'),
	(4, 8, '2026-03-01', 2, 'Completed'),
	(5, 4, '2026-02-10', 1, 'Cancelled'),
	(5, 1, '2026-03-11', 1, 'Completed'),
	(6, 2, '2026-02-11', 1, 'Completed'),
	(6, 8, '2026-02-28', 1, 'Completed'),
	(6, 9, '2026-03-08', 1, 'Completed'),
	(6, 7, '2026-03-15', 1, 'Completed'),
	(7, 2, '2026-02-20', 1, 'Cancelled'),
	(8, 1, '2026-02-28', 1, 'Completed'),
	(8, 9, '2026-03-07', 1, 'Completed'),
	(8, 10, '2026-03-11', 1, 'Completed');

-- Очистка данных
UPDATE Orders 
SET status = 'Completed' 
WHERE status LIKE 'Com%'; -- Исправит и Completed, и Comlpeted